# IsSurfaceBackgroundPatternVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..IsSurfaceBackgroundPatternVisible Property
OverrideGraphicSettings Class See Also
---
The visibility of the surface background fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsSurfaceBackgroundPatternVisible { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSurfaceBackgroundPatternVisible As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSurfaceBackgroundPatternVisible {
	bool get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace